In [1]:
import pandas as pd
print(pd.__version__)

1.2.2

## Persiapan Data Frame

In [2]:
d = {'kolom_satu':[1, 2, 3, 4, 5], #key pada dictionary ini tanpa spasi
     'kolom dua':[10, 20, 30, 40, 50]} #key pada dictionary ini menggunakan spasi
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

## Seleksi Baris Dengan `Query()`

In [9]:
df.query('kolom_satu > 2') # query statement harus dituliskan dalam bentuk string

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [16]:
df.query('`kolom dua` > 30')
# best praktisi dalam data science selalu menganjurkan untuk mengganti karakter spasi dalam nama kolom dengan karakter underscore
# jika suatu saat kita menemukan kasus data frame kita memiliki kolom yg mengandung spasi dan kita butuh untuk mengeksekusi function query,\
# maka langkah yang bisa kita butuhkan adalah cukup mengapit nama kolom yang mengandung spasi dengan menggunakan backtip(`)

   kolom_satu  kolom dua
3           4         40
4           5         50